app/controllers/api/addresses_controller.rb

  def create
    @address = Address.new(address_params)

    respond_to do |format|
      if @address.save
---
INSERT INTO "addresses" ("street", "city", "county", "postcode", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["street", "sadfgfrb"], ["city", "sdgvsaf"], ["county", "sdafaf"], ["postcode", "sdag"], ["created_at", "2018-08-07 16:09:21.129194"], ["updated_at", "2018-08-07 16:09:21.129194"]]