app/controllers/api/customers_controller.rb

  def create
    logger.debug "New post: #{customer_params[:address]}"
    @customer = Customer.new()
    @customer.title =  customer_params[:title]
    @customer.forename =  customer_params[:forename]
    @customer.surname =  customer_params[:surname]
    @customer.email =  customer_params[:email]
    @customer.date_of_birth =  customer_params[:date_of_birth]
    @customer.license_period =  customer_params[:license_period]
    @customer.job_title =  customer_params[:job_title]
    @customer.current_license_type =  customer_params[:current_license_type]
    @address = Address.create(customer_params[:address])
---
INSERT INTO "addresses" ("street", "city", "county", "postcode", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["street", "safdg"], ["city", "ew"], ["county", "g"], ["postcode", "sfg"], ["created_at", "2018-08-07 18:44:12.041409"], ["updated_at", "2018-08-07 18:44:12.041409"]]
INSERT INTO "customers" ("title", "forename", "surname", "email", "date_of_birth", "license_period", "job_title", "current_license_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)