app/controllers/api/driverhistories_controller.rb

    def set_driverhistory
      @driverhistory = Driverhistory.find(params[:id])
---
SELECT  "driverhistories".* FROM "driverhistories" WHERE "driverhistories"."id" = ? LIMIT 1  [["id", 16]]