app/controllers/api/incidents_controller.rb

  def index
    @incidents = Incident.all
---
SELECT "incidents".* FROM "incidents"

  def create
    @incident = Incident.new(incident_params)
    @incident.customer_id = session[:customer_id]
    @driverhistory = Driverhistory.find_by(customer_id: session[:customer_id])
    @driverhistory.increment!(:no_of_incidents)
    respond_to do |format|
      if @incident.save
---
SELECT  "driverhistories".* FROM "driverhistories" WHERE "driverhistories"."customer_id" IS NULL LIMIT 1
UPDATE "driverhistories" SET "no_of_incidents" = ?, "updated_at" = ? WHERE "driverhistories"."id" = ?  [["no_of_incidents", 1], ["updated_at", "2018-08-12 16:26:15.163947"], ["id", 9]]
INSERT INTO "incidents" ("date_of_incident", "value", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["date_of_incident", "1990-12-12"], ["value", 2000], ["description", "asdf"], ["created_at", "2018-08-12 17:35:08.689860"], ["updated_at", "2018-08-12 17:35:08.689860"]]