app/views/customers/_form.html.erb

        <%= f.label :job_title %><br>
        <%= collection_select( :customer, :job_title, Occupation.all, :name, :name, {}, { :multiple => false} ) %>
---
SELECT "occupations".* FROM "occupations"  ORDER BY "occupations"."name" ASC