app/views/customers/show.html.erb

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."customer_id" = ? LIMIT 1  [["customer_id", 1]]
---
  <strong>County:</strong>
    <%= @customer.address.county %>