app/controllers/addresses_controller.rb

INSERT INTO "addresses" ("street", "city", "county", "postcode", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["street", "dsada"], ["city", "sdagsa"], ["county", "gasfdgsafg"], ["postcode", "safgfdsg"], ["created_at", "2018-07-23 18:11:20.881726"], ["updated_at", "2018-07-23 18:11:20.881726"]]
---
  def create
    @address = Address.new(address_params)

    respond_to do |format|
      if @address.save