app/controllers/customers_controller.rb

INSERT INTO "addresses" ("street", "city", "county", "postcode", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["street", "adg"], ["city", "bdgsb"], ["county", "dfag"], ["postcode", "ae4r"], ["created_at", "2018-07-24 19:10:00.903044"], ["updated_at", "2018-07-24 19:10:00.903044"]]
INSERT INTO "customers" ("title", "forename", "surname", "email", "license_period", "job_title", "current_license_type", "date_of_birth", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "driverhistories" ("customer_id", "no_of_incidents", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["customer_id", 74], ["no_of_incidents", 0], ["created_at", "2018-08-11 12:04:34.860669"], ["updated_at", "2018-08-11 12:04:34.860669"]]
---
  def create
    @customer = Customer.new(customer_params)
    @address = Address.create(address_params)
    @customer.address = @address



    # logger.debug "New post: #{params[:name]}"
    # @customer.occupation = Occupation.find_by name: params[:name]



    respond_to do |format|
      if @customer.save

        format.html {redirect_to :controller => 'vehicles', :action => 'new', notice: 'Customer was successfully created.' }
      else
        format.html { render :new }
      end
    end
    session[:customer_id] = @customer.id

    Driverhistory.create(customer_id: session[:customer_id], no_of_incidents: 0)

UPDATE "customers" SET "job_title" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["job_title", "15"], ["updated_at", "2018-07-29 14:00:18.799319"], ["id", 12]]
---
  def update
    respond_to do |format|
      if @customer.update(customer_params)