app/controllers/driverhistories_controller.rb

SELECT "driverhistories".* FROM "driverhistories"
---
  def index
    @driverhistories = Driverhistory.all

DELETE FROM "driverhistories" WHERE "driverhistories"."id" = ?  [["id", 1]]
---
  def destroy
    @driverhistory.destroy

SELECT  "driverhistories".* FROM "driverhistories" WHERE "driverhistories"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_driverhistory
      @driverhistory = Driverhistory.find(params[:id])