app/controllers/incidents_controller.rb

  def index
    @incidents = Incident.all
---
SELECT "incidents".* FROM "incidents"

  def create
    @incident = Incident.new(incident_params)
    @incident.customer_id = session[:customer_id]
    @driverhistory = Driverhistory.find_by(customer_id: session[:customer_id])
    @driverhistory.increment!(:no_of_incidents)
    if params[:calculate_premium]
      respond_to do |format|
        if @incident.save
---
SELECT  "driverhistories".* FROM "driverhistories" WHERE "driverhistories"."customer_id" = ? LIMIT 1  [["customer_id", 79]]
UPDATE "driverhistories" SET "no_of_incidents" = ?, "updated_at" = ? WHERE "driverhistories"."id" = ?  [["no_of_incidents", 1], ["updated_at", "2018-08-12 14:50:55.466355"], ["id", 16]]
INSERT INTO "incidents" ("type_of_incident", "description", "date_of_incident", "customer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["type_of_incident", ""], ["description", ""], ["date_of_incident", "2018-08-11"], ["customer_id", 58], ["created_at", "2018-08-11 10:57:29.616145"], ["updated_at", "2018-08-11 10:57:29.616145"]]

    def set_incident
      @incident = Incident.find(params[:id])
---
SELECT  "incidents".* FROM "incidents" WHERE "incidents"."id" = ? LIMIT 1  [["id", 1]]