app/controllers/occupations_controller.rb

  def index
    @occupations = Occupation.all
---
SELECT "occupations".* FROM "occupations"

  def create
    @occupation = Occupation.new(occupation_params)

    respond_to do |format|
      if @occupation.save
---
INSERT INTO "occupations" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "sda"], ["created_at", "2018-07-19 17:57:14.209660"], ["updated_at", "2018-07-19 17:57:14.209660"]]

  def destroy
    @occupation.destroy
---
DELETE FROM "occupations" WHERE "occupations"."id" = ?  [["id", 1]]

    def set_occupation
      @occupation = Occupation.find(params[:id])
---
SELECT  "occupations".* FROM "occupations" WHERE "occupations"."id" = ? LIMIT 1  [["id", 1]]