app/controllers/vehicles_controller.rb

INSERT INTO "vehicles" ("vehicle_registration", "estimated_annual_mileage", "estimated_vehicle_value", "typical_parking_location", "policy_start_date", "customer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @vehicle = Vehicle.new(vehicle_params)
    @vehicle.customer_id = session[:customer_id]
    respond_to do |format|
      if @vehicle.save

DELETE FROM "vehicles" WHERE "vehicles"."id" = ?  [["id", 1]]
---
  def destroy
    @vehicle.destroy